Reports Saved/Graphs Results/GRAPHICAL_REPRESENTATION_AggregateReportGui.csv
Label,# Samples,Average,Median,90% Line,95% Line,99% Line,Min,Max,Error %,Throughput,Received KB/sec,Std. Dev.
Home Page HTTP Request,24,4040,2352,7923,16594,19811,2219,19811,0.00%,.1,4.2,4444.12
Archives Page HTTP Request,24,3700,3365,4315,4627,7770,3138,7770,0.00%,.1,3.4,928.17
TOTAL,48,3870,3244,4315,7923,19811,2219,19811,0.00%,.2,7.5,3214.77