Reports Saved/Graphs Results/GRAPHICAL_REPRESENTATION_SynthesisReportGui.csv
Label,# Samples,Average,Min,Max,90% Line,Std. Dev.,Error %,Throughput,Received KB/sec,Avg. Bytes
Home Page HTTP Request,24,4040,2219,19811,7923,4444.12,0.00%,.1,4.23,55288.6
Archives Page HTTP Request,24,3700,3138,7770,4315,928.17,0.00%,.1,3.36,44003.3
TOTAL,48,3870,2219,19811,4315,3214.77,0.00%,.2,7.52,49646.0